wavemakerTank/wavemakerTank/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          1900;
        startFace       556200;
    }
    outlet
    {
        type            patch;
        nFaces          1900;
        startFace       558100;
    }
    bottom
    {
        type            patch;
        nFaces          10000;
        startFace       560000;
    }
    wall1
    {
        type            patch;
        nFaces          1900;
        startFace       570000;
    }
    wall2
    {
        type            patch;
        nFaces          1900;
        startFace       571900;
    }
    atmosphere
    {
        type            patch;
        nFaces          10000;
        startFace       573800;
    }
)

// ************************************************************************* //
