wavemakerTank/wavemakerTank/constant/wavemakerMovement.txt
wavemakerType   Piston;
tSmooth         1.5;
genAbs          0;

timeSeries 621(
0.0
0.05
0.1
0.15
0.2
0.25
0.3
0.35
0.4
0.45
0.5
0.55
0.6
0.65
0.7
0.75
0.8
0.85
0.9
0.95
1.0
1.05
1.1
1.15
1.2
1.25
1.3
1.35
1.4
1.45
1.5
1.55
1.6
1.65
1.7
1.75
1.8
1.85
1.9
1.95
2.0
2.05
2.1
2.15
2.2
2.25
2.3
2.35
2.4
2.45
2.5
2.55
2.6
2.65
2.7
2.75
2.8
2.85
2.9
2.95
3.0
3.05
3.1
3.15
3.2
3.25
3.3
3.35
3.4
3.45
3.5
3.55
3.6
3.65
3.7
3.75
3.8
3.85
3.9
3.95
4.0
4.05
4.1
4.15
4.2
4.25
4.3
4.35
4.4
4.45
4.5
4.55
4.6
4.65
4.7
4.75
4.8
4.85
4.9
4.95
...
);

paddlePosition 10(
621(
-0.0328230795365
0.0164467248963
0.0651221018398
0.111443796349
0.153737621694
0.190474968831
0.220328054318
0.242217909862
0.255353379051
0.259259711804
0.253795723078
0.239158895662
0.215878242634
0.184795187453
0.147033152717
0.103956956751
0.0571234855111
0.0082254226708
-0.0409699283759
-0.088684519465
-0.133193820955
-0.172889150723
-0.206335816126
-0.232324967531
-0.249917289292
-0.258476949066
-0.257694578445
-0.247598454342
-0.228553476988
-0.201247981486
-0.166668859586
-0.126065890849
-0.0809065723551
-0.0328230795365
0.0164467248963
0.0651221018398
0.111443796349
0.153737621694
0.190474968831
0.220328054318
0.242217909862
0.255353379051
0.259259711804
0.253795723078
0.239158895662
0.215878242634
0.184795187453
0.147033152717
0.103956956751
0.0571234855111
0.0082254226708
-0.0409699283759
-0.088684519465
-0.133193820955
-0.172889150723
-0.206335816126
-0.232324967531
-0.249917289292
-0.258476949066
-0.257694578445
-0.247598454342
-0.228553476988
-0.201247981486
-0.166668859586
-0.126065890849
-0.0809065723551
-0.0328230795365
0.0164467248963
0.0651221018398
0.111443796349
0.153737621694
0.190474968831
0.220328054318
0.242217909862
0.255353379051
0.259259711804
0.253795723078
0.239158895662
0.215878242634
0.184795187453
0.147033152717
0.103956956751
0.0571234855111
0.0082254226708
-0.0409699283759
-0.088684519465
-0.133193820955
-0.172889150723
-0.206335816126
-0.232324967531
-0.249917289292
-0.258476949066
-0.257694578445
-0.247598454342
-0.228553476988
-0.201247981486
-0.166668859586
-0.126065890849
-0.0809065723551
...
);

paddleEta 10(
621(
0.247988872758
0.249496584166
0.241986838966
0.225731058915
0.201316770259
0.169626368999
0.131805228807
0.0892203042299
0.0434107253971
-0.00396783015704
-0.0512029779912
-0.0965875167928
-0.138481131081
-0.175369676483
-0.205919904856
-0.229027651348
-0.243857741795
-0.249874178088
-0.246859510544
-0.234922697103
-0.214495165303
-0.186315219368
-0.151401355965
-0.111015453085
-0.0666171624832
-0.0198111540595
0.0277108810893
0.0742313727955
0.118068949281
0.157639206314
0.191511971706
0.21846299546
0.237518197359
0.247988872758
0.249496584166
0.241986838966
0.225731058915
0.201316770259
0.169626368999
0.131805228807
0.0892203042299
0.0434107253971
-0.00396783015704
-0.0512029779912
-0.0965875167928
-0.138481131081
-0.175369676483
-0.205919904856
-0.229027651348
-0.243857741795
-0.249874178088
-0.246859510544
-0.234922697103
-0.214495165303
-0.186315219368
-0.151401355965
-0.111015453085
-0.0666171624832
-0.0198111540595
0.0277108810893
0.0742313727955
0.118068949281
0.157639206314
0.191511971706
0.21846299546
0.237518197359
0.247988872758
0.249496584166
0.241986838966
0.225731058915
0.201316770259
0.169626368999
0.131805228807
0.0892203042299
0.0434107253971
-0.00396783015704
-0.0512029779912
-0.0965875167928
-0.138481131081
-0.175369676483
-0.205919904856
-0.229027651348
-0.243857741795
-0.249874178088
-0.246859510544
-0.234922697103
-0.214495165303
-0.186315219368
-0.151401355965
-0.111015453085
-0.0666171624832
-0.0198111540595
0.0277108810893
0.0742313727955
0.118068949281
0.157639206314
0.191511971706
0.21846299546
0.237518197359
...
);

